[
    {   "id": 1,
        "description": "He told his story in an interview. Here his speech: 'I was born in Sarishabari, Jamalpur. I am the youngest child of my parents and had a wonderful childhood. My mother worked in the local post office and my father is a retired school teacher. I studied in Sarishabari until my secondary education. Not to sound boastful but I maintained a fairly upward trajectory in my education life. After SSC examination, I came to Dhaka and got into Dhaka College for higher secondary education. My college days were full of meaningful experiences. As Dhaka College used to attract students from around the country, I had the opportunity to see and learn a lot of things. There was once an incident when I was hiding away from a pugnacious political leader because I raised my voice against his wrongdoing. Because of this and other reasons, I suffered from frustration throughout the first year of my college life. I was also not quite satisfied with my academic experience there. When I was in high school, I used to ask a lot of questions to my teachers. It was not a usual practice in a suburban school, as you might wonder, but the teachers - especially the headmaster of my school, Babu Jyotish Chandra Saha, and another from whom I received private tuition, late Chandra Nath, never discouraged me. They were very concerned to the extent that they allotted extra time for satisfying my unending inquiries after school. It was a greatly influential aspect of my life which built a strong sense of responsibility in me. But when I came to Dhaka College, I saw that most teachers, with a few exceptions, discouraged questions from students in general. The college had many teachers whose reputation ran countrywide. But whenever I asked something, many of my teachers either ignored my call or taunted me. I realized that the relationship we had with our teachers was strictly realized. It was a demoralizing experience for me. Consequently, I gradually became inattentive to my studies.  In fact, it took a toll on my first-year studies and result. While it was a challenging experience for me, it was also where I got the inspiration for the first time, I assume, to build an educational institution where we would encourage students to pursue their intellectual curiosity without any bound which later became Udvash. Anyways, the next year I turned around and focused on my studies. I was also inspired by others' expectation of me, especially that of people in my hometown who thought of me with high regard. Often positive external expectation works as a motivation. I soon overcame my deficiencies and as I mentioned earlier, vowed to myself to build an organization someday where members would be encouraged to ask questions because an inquirer is also a thinker. One who doesn't question doesn't know how to think and thinking is one of the most important skills you need to learn in life. We will get back to it later. Let's get back to my college days. I worked hard throughout the rest of the year. I particularly remember the month of Ramadan of that year when I literally utilized every waking moment. I can't believe now that I was the one who worked that hard once.  I studied almost all the time. My labor paid off satisfactorily. I came in fourth in the HSC examination in Dhaka Board which was better than my SSC result. Soon after that, I sat for the admission test for BUET. Although everyone expected that I would top the merit list, I didn't do very well, but not very poor either. I secured the 141st position in BUET admission test and learned that you have to work equally hard every day regardless of what was your result yesterday. This was back in 2000. I chose electronics and electrical engineering (EEE) in BUET. After the admission, I had a little short-lived dissonance with my major because CSE was the most sought-after major at that time. But I later realized that EEE was a blessing for me and that decision continues to serve me well even these days. My admission procedure in BUET was finished in November 2000, and in December the same year, I, along with a friend, opened Udvash that marked the beginning of my entrepreneurial journey. There was a year-long session jam in BUET that year. So we had ample time at hand and we found a better way to spend our time - teaching students.'"
        }
    ]